In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  13   4  10   8   4
1   9   4  11   8  18
2   3   9   4  17  19
3   6   6  19  10   8
4   6  18   2  18   5

In [3]:
df.query('A > 10')

    A  B   C  D  E
0  13  4  10  8  4

In [4]:
rerata = df['A'].mean()
rerata

np.float64(7.4)

In [5]:
df.query('A > @rerata')

    A  B   C  D   E
0  13  4  10  8   4
1   9  4  11  8  18